In [24]:
import pandas as pd
import numpy as np

In [25]:
box_mojo_df = pd.read_csv('data/bom.movie_gross.csv')
numbers_df = pd.read_csv('data/tn.movie_budgets.csv')
title_basics_df = pd.read_csv('data/imdb.title.basics.csv')
name_basics_df = pd.read_csv('data/imdb.name.basics.csv')
crew_df = pd.read_csv('data/imdb.title.crew.csv')
principal_df = pd.read_csv('data/imdb.title.principals.csv')
ratings_df = pd.read_csv('data/imdb.title.ratings.csv')
tmdb_df = pd.read_csv('data/tmdb.movies.csv')
rt_df = pd.read_csv('data/rt.movie_info.tsv', delimiter='\t')

In [128]:
title_basics_df[title_basics_df['primary_title'] == 'Robin Hood']

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
481,tt0955308,Robin Hood,Robin Hood,2010,140.0,"Action,Adventure,Drama"
37685,tt2363363,Robin Hood,Robin Hood,2013,92.0,"Action,Drama"
79017,tt4532826,Robin Hood,Robin Hood,2018,116.0,"Action,Adventure,Thriller"
115642,tt6858500,Robin Hood,Robin Hood,2018,NaN,NaN
135285,tt8558276,Robin Hood,Robin Hood,2017,60.0,"Action,Adventure,History"

In [127]:
tb_df = title_basics_df[['primary_title', 'start_year', 'runtime_minutes']]
tb_df[tb_df['primary_title'] == 'Avatar']

      primary_title  start_year  runtime_minutes
17060        Avatar        2011             93.0

In [55]:
tb_df.sort_values('start_year')

,primary_title,start_year,runtime_minutes
9599,Brainiacs in La La Land,2010,NaN
43264,Fireplace for your Home: Crackling Fireplace w...,2010,61.0
11550,Role/Play,2010,85.0
11551,Johan1,2010,78.0
11552,Hands Up,2010,90.0
...,...,...,...
2948,Untitled Star Wars Film,2024,NaN
52213,Avatar 4,2025,NaN
2949,Untitled Star Wars Film,2026,NaN
96592,Avatar 5,2027,NaN
89506,100 Years,2115,NaN

In [56]:
tb_df = tb_df[tb_df['start_year'] < 2022]

In [43]:
tb_df.isna().sum()

primary_title          0
original_title        21
start_year             0
runtime_minutes    31699
dtype: int64

In [57]:
tb_df = tb_df.dropna(axis=0, subset=['runtime_minutes'])
tb_df

,primary_title,start_year,runtime_minutes
0,Sunghursh,2013,175.0
1,One Day Before the Rainy Season,2019,114.0
2,The Other Side of the Wind,2018,122.0
4,The Wandering Soap Opera,2017,80.0
5,A Thin Life,2018,75.0
...,...,...,...
146135,The Rehearsal,2019,51.0
146136,Illenau - die Geschichte einer ehemaligen Heil...,2017,84.0
146137,Safeguard,2019,90.0
146139,Kuambil Lagi Hatiku,2019,123.0
146142,6 Gunn,2017,116.0

In [111]:
numbers_df['release_date'] = pd.to_datetime(numbers_df['release_date'])
numbers_df['release_year'] = numbers_df['release_date'].dt.year

In [115]:
numbers_df = numbers_df.drop('release_date', 1)
numbers_df

,id,movie,production_budget,domestic_gross,worldwide_gross,release_year
0,1,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009
1,2,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011
2,3,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019
3,4,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015
4,5,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",2017
...,...,...,...,...,...,...
5777,78,Red 11,"$7,000",$0,$0,2018
5778,79,Following,"$6,000","$48,482","$240,495",1999
5779,80,Return to the Land of Wonders,"$5,000","$1,338","$1,338",2005
5780,81,A Plague So Pleasant,"$1,400",$0,$0,2015
5781,82,My Date With Drew,"$1,100","$181,041","$181,041",2005

In [116]:
numbers_tb_df = numbers_df.merge(tb_df,left_on='movie',right_on='primary_title',how='inner')
numbers_tb_df

,id,movie,production_budget,domestic_gross,worldwide_gross,release_year,primary_title,start_year,runtime_minutes
0,1,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009,Avatar,2011,93.0
1,2,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011,Pirates of the Caribbean: On Stranger Tides,2011,136.0
2,3,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019,Dark Phoenix,2019,113.0
3,4,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015,Avengers: Age of Ultron,2015,141.0
4,7,Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",2018,Avengers: Infinity War,2018,149.0
...,...,...,...,...,...,...,...,...,...
3810,68,Cure,"$10,000","$94,596","$94,596",2001,Cure,2014,NaN
3811,70,Bang,"$10,000",$527,$527,1996,Bang,2015,NaN
3812,73,Newlyweds,"$9,000","$4,584","$4,584",2012,Newlyweds,2011,95.0
3813,78,Red 11,"$7,000",$0,$0,2018,Red 11,2019,77.0
3814,81,A Plague So Pleasant,"$1,400",$0,$0,2015,A Plague So Pleasant,2013,76.0

In [120]:
numbers_tb_cleaned = numbers_tb_df.drop(['id', 'primary_title'], 1)

,movie,production_budget,domestic_gross,worldwide_gross,release_year,start_year,runtime_minutes
28,Robin Hood,"$210,000,000","$105,487,148","$322,459,006",2010,2010,140.0
29,Robin Hood,"$210,000,000","$105,487,148","$322,459,006",2010,2013,92.0
30,Robin Hood,"$210,000,000","$105,487,148","$322,459,006",2010,2018,116.0
31,Robin Hood,"$210,000,000","$105,487,148","$322,459,006",2010,2018,NaN
32,Robin Hood,"$210,000,000","$105,487,148","$322,459,006",2010,2017,60.0
33,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,2010,140.0
34,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,2013,92.0
35,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,2018,116.0
36,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,2018,NaN
37,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,2017,60.0

In [124]:
numbers_tb_cleaned = numbers_tb_cleaned.dropna(axis=0, subset=['runtime_minutes'])

In [125]:
numbers_tb_cleaned[numbers_tb_cleaned['movie'] == 'Robin Hood']

,movie,production_budget,domestic_gross,worldwide_gross,release_year,start_year,runtime_minutes
28,Robin Hood,"$210,000,000","$105,487,148","$322,459,006",2010,2010,140.0
29,Robin Hood,"$210,000,000","$105,487,148","$322,459,006",2010,2013,92.0
30,Robin Hood,"$210,000,000","$105,487,148","$322,459,006",2010,2018,116.0
32,Robin Hood,"$210,000,000","$105,487,148","$322,459,006",2010,2017,60.0
33,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,2010,140.0
34,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,2013,92.0
35,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,2018,116.0
37,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,2017,60.0

In [126]:
numbers_tb_cleaned

,movie,production_budget,domestic_gross,worldwide_gross,release_year,start_year,runtime_minutes
0,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009,2011,93.0
1,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011,2011,136.0
2,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019,2019,113.0
3,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015,2015,141.0
4,Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",2018,2018,149.0
...,...,...,...,...,...,...,...
3808,Clean,"$10,000","$138,711","$138,711",2006,2017,70.0
3809,Cure,"$10,000","$94,596","$94,596",2001,2011,93.0
3812,Newlyweds,"$9,000","$4,584","$4,584",2012,2011,95.0
3813,Red 11,"$7,000",$0,$0,2018,2019,77.0
3814,A Plague So Pleasant,"$1,400",$0,$0,2015,2013,76.0

In [103]:
numbers_tb_cleaned['release_date'] = pd.to_datetime(numbers_tb_cleaned['release_date'])
numbers_tb_cleaned['release_year'] = numbers_tb_cleaned['release_date'].dt.year

In [ ]:
box plot with the top10. 20-30